app/views/users/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 9 ORDER BY "users"."id" ASC LIMIT 1
---
        <h2>Pending:</h2>
          <% user = User.find(current_user.id)%>