app/views/users/show.html.erb

SELECT "events".* FROM "events"
---
  <div class="all-events">
    <% b = Event.all.to_a%>

SELECT "events".* FROM "events" ORDER BY "events"."created_at" ASC
---
        <h2>Pending Invites:</h2>
        <% events = Event.all.order(:created_at).to_a%>

INSERT INTO "invites" ("user_id", "event_id", "status", "created_at", "updated_at") VALUES (9, 2, 0, '2025-08-08 21:05:13.727721', '2025-08-08 21:05:13.727721') RETURNING "id"
SELECT "invites".* FROM "invites" WHERE "invites"."user_id" = 9 AND "invites"."event_id" = 2 LIMIT 1
---
        <% next if current_user.id == event.creator_id%>
        <% your_invite = Invite.find_or_create_by(user: current_user, event: event)%>

SELECT "events".* FROM "events" ORDER BY "events"."created_at" ASC
---
        <h2>Accepted Invites:</h2>
         <% events = Event.all.order(:created_at).to_a%>

SELECT "invites".* FROM "invites" WHERE "invites"."user_id" = 9 AND "invites"."event_id" = 2 LIMIT 1
---
        <% next if current_user.id == event.creator_id%>
        <% your_invite = Invite.find_or_create_by(user: current_user, event: event)%>