app/views/events/_event.html.erb

SELECT "invites".* FROM "invites" WHERE "invites"."user_id" = 8
---
            <%next if user.id == current_user.id%>
            <%next if  user.invites.find_by(event: event.id).status != "declined" if !user.invites.find_by(event: event.id).nil? %>