app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "updated_at", "location", "date", "creator_id", "title") VALUES ('2025-08-05 18:00:29.321473', '2025-08-05 18:00:29.321473', '32131231', NULL, 1, '432321') RETURNING "id"
---
  def create
    @event = current_user.created_events.build(event_params)

    respond_to do |format|
      if @event.save

DELETE FROM "events" WHERE "events"."id" = 1
---
  def destroy
    @event.destroy!

SELECT "events".* FROM "events" WHERE "events"."id" = 3 LIMIT 1
---
  def set_event
    @event = Event.find(params.expect(:id))