app/controllers/invites_controller.rb

  def index
    @invites = Invite.all
---
SELECT "invites".* FROM "invites"

  def update
    respond_to do |format|
      if @invite.update(invite_params)
        if @invite.status == 'declined'
          event = @invite.event
          user = @invite.user
          event.attendees.delete(user)
---
UPDATE "invites" SET "status" = 1, "updated_at" = '2025-08-06 21:26:30.834967' WHERE "invites"."id" = 8
DELETE FROM "invites" WHERE "invites"."id" = 13

  def set_invite
    @invite = Invite.find(params.expect(:id))
---
SELECT "invites".* FROM "invites" WHERE "invites"."id" = 22 LIMIT 1